###############################################################################
# Created by write_sdc
###############################################################################
current_design MFCC_Core
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name main_clk -period 10.0000 [get_ports {clk}]
set_propagated_clock [get_clocks {main_clk}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
